    {
        "name": "Brian Taylor",
        "role": "Full Stack Developer",
        "description": "Welcome! I'm Brian Taylor, a dedicated Full Stack Developer with a knack for building scalable web applications and working across the full stack of technology. With a love for coding and design, I craft software and digital solutions that are not only functional but also aesthetically pleasing.",
        "imageUrl": "assets/me3.png", 
        "resumeUrl": "brian-taylor-resume.pdf",
        "resumeDoc": "https://docs.google.com/document/d/1GraOy9czTcyPxVfR26UFOd8lBwiRAl0i2ji9WC_lnQE/edit?usp=sharing", 
        "fullstack": "Armed with experience in crafting web applications with cutting-edge technologies, I possess a robust understanding of key frameworks and libraries. Driven by endless curiosity and a dedication to lifelong learning, I stay at the forefront of technological advancements.",
        "experience": "I have worked on a variety of projects, from intricate web applications and mobile apps to robust APIs. Skilled in both team collaboration and solo endeavors, I thrive in dynamic, fast-paced environments, adapting swiftly to meet project demands and deadlines.",
        "backend": "As a Back-End Developer, I specialize in constructing APIs and web services utilizing the latest technologies. My expertise extends to databases and data modeling, where I adeptly navigate both SQL and NoSQL environments.",
        "education": "I have a certification in Full Stack Development with 500+ hour program focused on product development fundamentals, object-oriented programming, MVC frameworks, data modeling, and team collaboration strategies.",
       "interests": "I am passionate about technology and software development, and I am constantly learning new technologies and frameworks to stay up-to-date. I enjoy working on a variety of projects, and I am always looking for new opportunities to learn and grow.",
        "softSkills": "I have excellent communication skills and I am comfortable working with both technical and non-technical teams. I am a quick learner and I am always looking for new opportunities to learn and grow. I am also a team player and I enjoy collaborating with others to achieve common goals."
    }
