 [ 
    {
      "id": 1,
      "title": "SellOut: E-Commerce App",
      "description": "This is an e-commerce application developed using the MERN stack, catering to both buyers and tech enthusiasts. It allows users to browse through a variety of products, add them to their cart. Users can also leave reviews and ratings for products.",
      "imageUrl": "https://github.com/Quantumcode9/Sellout-Client/raw/main/readme/tvs.png",
      "videoUrl": "assets/Selloutvid.mov",
      "technologies": ["React", "MongoDB", "Node.js", "Express"],
      "link": "https://sellout-final.netlify.app/",
      "github": "https://github.com/Quantumcode9/Sellout-Client",
      "model": "/models/Laptop-Iphone.glb",
      "challenges": "Some of the challenges I faced was connecting the reviews to the product page. I had to figure out how to pass the product id to the review form and then save the review to the correct product.",
      "solution": "I was able to solve this by using the useParams hook to get the product id from the url and then pass it to the review form. I then saved the review to the correct product by using the product id."
    }, 
    {
      "id": 3,
      "title": "Gnosis: Tv Show Tracker App",
      "description": "This application serves as a personal tracker and reviewer for your favorite TV shows, integrating the TMDB API to provide comprehensive information on series. The app allows for easy tracking and reviewing, keeping all your television interests in one convenient place.",
      "imageUrl": "https://github.com/Quantumcode9/Project2-Gnosisapp/raw/main/Photos/Screenshot-Show.png",
      "videoUrl": "assets/gnosis.mp4",
      "technologies": ["MongoDB", "Node.js", "Express"],
      "link": "https://gnosis-app.fly.dev",
      "github": "https://github.com/Quantumcode9/Project2-Gnosisapp",
      "model": "/models/Gnosis-model.glb",
      "challenges": "This was my first time working with an API, and I encountered difficulties in extracting the necessary data for my app. The lack of clear documentation and unfamiliarity with the API structure posed significant challenges, hindering my progress.",
      "solution": "I decided to switch to the TMDB API, which offered more comprehensive documentation and a user-friendly structure. By leveraging the API's extensive resources and seeking guidance from online resources, I successfully integrated the TMDB API into my app, overcoming the initial hurdles."

    },
    {
      "id": 2,
      "title": "What's Happening: Event Planner",
      "description": "This app provides a user-friendly platform for organizing various events. Leveraging the power of Django and Python for the backend, Postgres for the database, and AWS S3 for storage, it offers a robust and scalable solution to handle all aspects of event management efficiently.",
      "imageUrl": "https://github.com/Quantumcode9/whats-happening/raw/main/readme/photos/hub.png",
      "technologies": ["Django", "Python", "Postgres","AWS S3"],
      "videoUrl": "assets/Whats-Happening.mp4",
      "link": "https://whats-happening.onrender.com",
      "model": "/models/Whats-Happening.glb",
      "github": "https://github.com/Quantumcode9/whats-happening?tab=readme-ov-file",
      "challenges": "This was my first team project with the steep learning curve of collaborative tools, version control, and effective communication. This led to challenges in coordinating tasks and managing conflicts",
      "solution": "To overcome these challenges, I focused on clear communication, regular updates, and effective collaboration with my team members. By leveraging tools like GitHub, Slack, and Zoom, we successfully managed the project and delivered a high-quality product."
    }

    

  ]
