    {
        "name": "Brian Taylor",
        "role": "Full Stack Developer",
        "description": "I’m a Full Stack Developer who builds scalable production web applications that people actually use. I've created a screenplay database serving the screenwriting community, a comprehensive writing platform with AI integration and real-time collaboration, and specialized rich text editors for creative content. I work across the full stack with modern JavaScript/TypeScript, focusing on scalability and user experience.",
        "imageUrl": "assets/me2.png", 
        "resumeUrl": "assets/resume-brian-taylor-2025.pdf",
        "resumeDoc": "https://docs.google.com/document/d/1GraOy9czTcyPxVfR26UFOd8lBwiRAl0i2ji9WC_lnQE/edit?usp=sharing", 
        "fullstack": "I build responsive, feature-rich interfaces with React, Next.js, and Tailwind CSS. I've created custom text editors with TipTap/ProseMirror, real-time collaboration features, and complex data visualization dashboards. I focus on performance, accessibility, and creating intuitive user experiences.",
        "experience": "I've built and deployed multiple production SaaS applications including custom rich text editing platforms, AI-integrated web apps, large scale databases. I'm comfortable working solo or in teams, and I ship fast.",
        "backend": "I build RESTful APIs, handle authentication with OAuth, and design database schemas for both SQL and NoSQL. I've architected systems handling file storage with AWS S3, real-time messaging with WebSockets, and AI integration via OpenRouter and OpenAI APIs.",
        "education": "Completed an intensive 500+ hour Software Engineering certification covering full-stack development, OOP, MVC frameworks, and agile team collaboration. Though, my real education comes from building projects and solving problems daily.",
        "interests": "Outside of coding, I'm deep into developer tooling and content creation platforms. I've built custom TipTap extensions that power real-world writing applications, and I'm always experimenting with AI integration to enhance user experiences.",
        "softSkills": "I communicate clearly with both developers and non-technical stakeholders. I work well in teams, adapt quickly to new codebases, and I'm comfortable taking ownership of features from concept to deployment."
    }
